'''
  说明符     含义                           示例
    %d   十进制整数                          199
    %i   整数，同%d                          199
    %s   可输入字符串，也可以输入整数        Thomas
    %i   同%s                                'bob'
    %x   十六进制数，小写字母表示            ff09a
    %X   十六进制数，大写字母表示            af5
    %o   八进制整数                          74
    %u   无符号整数                          257
    %f   以固定位数输出浮点数                3.1400
    %F   与%f含义相同                        33.1400
    %e   用指数符号（e）输出浮点数           3.140000e+00
    %E   同%e                                3.140000E+00
    %g   以最短规范表示的浮点数              7e-06
    %G   同%g                                7E-06
    %%   文字百分号                          %

'''