dic = [
    {
        "alarm_type": "A故障",
        "time": "2022-12-19 17:16:11",
        "address": "世界之窗",
        "id_number": "A8O0002",
        "异常时间": 158
    },
    {
        "alarm_type": "A故障",
        "time": "2022-12-19 17:16:11",
        "address": "天河区",
        "id_number": "A8O0000",
        "异常时间": 155
    },
    {
        "alarm_type": "B故障",
        "time": "2022-12-19 15:12:52",
        "address": "世界之窗",
        "id_number": "A8O0002",
        "异常时间": 559
    },
    {
        "alarm_type": "B故障",
        "time": "2022-12-19 15:08:48",
        "address": "天河区",
        "id_number": "A8O0000",
        "异常时间": 312
    },
    {
        "alarm_type": "C故障",
        "time": "2022-12-19 15:02:49",
        "address": "世界之窗",
        "id_number": "A8O0002",
        "异常时间": 150
    },
    {
        "alarm_type": "C故障",
        "time": "2022-12-19 14:42:13",
        "address": "天河区",
        "id_number": "A8O0000",
        "异常时间": 50
    }
]
'''
题目：
将dic变成result：

总时间为今天零点到当前时刻的中秒数；如01:00则秒数为3600；01:01则秒数为3660
import time
#为当前时间到当天0点的秒数、86400为1天的秒数、北京时间的time.timezone值是-28800，所以是+
all_time = int(time.time()-time.timezone) % 86400

总异常时间 = A故障+B故障+C故障
正常时间= 总时间-总异常时间

A故障 = A故障时间 / 总时间 * 100%   # 最终结果数据格式：94.45%
正常率 = 正常时间 / 总时间 * 100%   # 最终结果数据格式：94.45%
'''

result = {
    'A8O0002': {
        '总异常时间': 717,
        '总时间': 67485,
        'id_number': 'A8OQG050',
        'address': '巴登街',
        'begin_time': '2022-12-19 15:02:49',
        'A故障率': "94.45%",
        'B故障率': "94.45%",
        'C故障率': "94.45%",
        '正常时间': "18.54h",
        '正常率': "94.45%"
    },
    'A8O0000': {
        '总异常时间': 467,
        '总时间': 67485,
        "address": "天河区",
        "id_number": "A8O0000",
        'begin_time': '2022-12-19 14:42:13',
        'A故障率': "94.45%",
        'B故障率': "94.45%",
        'C故障率': "94.45%",
        '正常时间': "18.6h",
        '正常率': "94.45%",
    }
}
